tutorials/acoustics/gaussPulse_OF_OF/fluid_A/constant/couplingProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object couplingProperties;
}

movingSolidPatches (top);

movingFluidPatches (top);

acousticsPatch east;
